
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       9 |          5 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                |
|:--------:|:---------------------------------------------------------------------------------------------------------|
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                                  |
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access`             |
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default`  |
|    🟢     | `module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled`                            |
|    🟢     | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_ro`                      |
|    🟢     | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_rw`                      |
|    🟢     | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager`                         |
|    🟢     | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-ro`    |
|    🟢     | `module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]` |
|    🟢     | `data.aws_iam_policy_document.ih-tf-github-control-assume:`                                              |
|    🟡     | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket`                       |
|    🟡     | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket`                       |
|    🟡     | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`                       |
|    🟡     | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket`                       |
|    🟡     | `module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket`                                   |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/e323dff3-a181-4eda-8f43-e750a026e666/terraform-bin plan -no-color --out=tf.plan
data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]
data.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Reading...
aws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3211474565]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]
aws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]
aws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 1s [id=3184570819]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-ro20230810231251274700000006]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-ro20230811153208393500000002]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-ro20230810231251272400000005]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only]
module.ih-tf-aws-control-289256138624-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-ro20230810231251270100000004]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-ro20230810231251262700000001]
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only-20230811153208651800000003]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125193800000000e]
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3532652678]
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...
module.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125190470000000c]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-rw20230811153208390900000001]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-rw20230810231251266200000002]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-rw20230810231251267600000003]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-rw20230810231251542800000007]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-rw20230810231251545600000008]
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-2023081023125190440000000b]
data.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]
module.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125187350000000a]
aws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]
aws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]
module.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230810231252046000000010]
module.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125199570000000f]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github-20230817154309876900000001]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-2023081023125191850000000d]
module.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230810231251872800000009]
module.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]
module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]
module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]
module.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]
module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-289256138624"].data.terraform_remote_state.state will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = ""
              + acl                                  = null
              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-289256138624"
              + bucket                               = "infrahouse-aws-control-289256138624"
              + bucket_domain_name                   = "infrahouse-aws-control-289256138624.s3.amazonaws.com"
              + bucket_prefix                        = ""
              + bucket_regional_domain_name          = "infrahouse-aws-control-289256138624.s3.us-west-1.amazonaws.com"
              + cors_rule                            = []
              + force_destroy                        = false
              + grant                                = [
                  + {
                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"
                      + permissions = [
                          + "FULL_CONTROL",
                        ]
                      + type        = "CanonicalUser"
                      + uri         = ""
                    },
                ]
              + hosted_zone_id                       = "Z2F56UZL2M1ACD"
              + id                                   = "infrahouse-aws-control-289256138624"
              + lifecycle_rule                       = []
              + logging                              = []
              + object_lock_configuration            = []
              + object_lock_enabled                  = false
              + policy                               = ""
              + region                               = "us-west-1"
              + replication_configuration            = []
              + request_payer                        = "BucketOwner"
              + server_side_encryption_configuration = [
                  + {
                      + rule = [
                          + {
                              + apply_server_side_encryption_by_default = [
                                  + {
                                      + kms_master_key_id = ""
                                      + sse_algorithm     = "AES256"
                                    },
                                ]
                              + bucket_key_enabled                      = false
                            },
                        ]
                    },
                ]
              + tags                                 = {
                  + description = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
                  + repo        = "infrahouse/aws-control-289256138624"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
                  + repo        = "infrahouse/aws-control-289256138624"
                }
              + timeouts                             = null
              + versioning                           = [
                  + {
                      + enabled    = true
                      + mfa_delete = false
                    },
                ]
              + website                              = []
              + website_domain                       = null
              + website_endpoint                     = null
            }
          + key    = "terraform.tfstate"
          + region = "us-west-1"
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-289256138624"
      ~ tags                        = {
            "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          + "repo"        = "infrahouse/aws-control-289256138624"
        }
      ~ tags_all                    = {
          + "repo"        = "infrahouse/aws-control-289256138624"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].data.terraform_remote_state.state will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = ""
              + acl                                  = null
              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-303467602807"
              + bucket                               = "infrahouse-aws-control-303467602807"
              + bucket_domain_name                   = "infrahouse-aws-control-303467602807.s3.amazonaws.com"
              + bucket_prefix                        = ""
              + bucket_regional_domain_name          = "infrahouse-aws-control-303467602807.s3.us-west-1.amazonaws.com"
              + cors_rule                            = []
              + force_destroy                        = false
              + grant                                = [
                  + {
                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"
                      + permissions = [
                          + "FULL_CONTROL",
                        ]
                      + type        = "CanonicalUser"
                      + uri         = ""
                    },
                ]
              + hosted_zone_id                       = "Z2F56UZL2M1ACD"
              + id                                   = "infrahouse-aws-control-303467602807"
              + lifecycle_rule                       = []
              + logging                              = []
              + object_lock_configuration            = []
              + object_lock_enabled                  = false
              + policy                               = ""
              + region                               = "us-west-1"
              + replication_configuration            = []
              + request_payer                        = "BucketOwner"
              + server_side_encryption_configuration = [
                  + {
                      + rule = [
                          + {
                              + apply_server_side_encryption_by_default = [
                                  + {
                                      + kms_master_key_id = ""
                                      + sse_algorithm     = "AES256"
                                    },
                                ]
                              + bucket_key_enabled                      = false
                            },
                        ]
                    },
                ]
              + tags                                 = {
                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
                  + repo        = "infrahouse/aws-control-303467602807"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
                  + repo        = "infrahouse/aws-control-303467602807"
                }
              + timeouts                             = null
              + versioning                           = [
                  + {
                      + enabled    = true
                      + mfa_delete = false
                    },
                ]
              + website                              = []
              + website_domain                       = null
              + website_endpoint                     = null
            }
          + key    = "terraform.tfstate"
          + region = "us-west-1"
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-303467602807"
      ~ tags                        = {
            "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          + "repo"        = "infrahouse/aws-control-303467602807"
        }
      ~ tags_all                    = {
          + "repo"        = "infrahouse/aws-control-303467602807"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].data.terraform_remote_state.state will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = ""
              + acl                                  = null
              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-493370826424"
              + bucket                               = "infrahouse-aws-control-493370826424"
              + bucket_domain_name                   = "infrahouse-aws-control-493370826424.s3.amazonaws.com"
              + bucket_prefix                        = ""
              + bucket_regional_domain_name          = "infrahouse-aws-control-493370826424.s3.us-west-1.amazonaws.com"
              + cors_rule                            = []
              + force_destroy                        = false
              + grant                                = [
                  + {
                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"
                      + permissions = [
                          + "FULL_CONTROL",
                        ]
                      + type        = "CanonicalUser"
                      + uri         = ""
                    },
                ]
              + hosted_zone_id                       = "Z2F56UZL2M1ACD"
              + id                                   = "infrahouse-aws-control-493370826424"
              + lifecycle_rule                       = []
              + logging                              = []
              + object_lock_configuration            = []
              + object_lock_enabled                  = false
              + policy                               = ""
              + region                               = "us-west-1"
              + replication_configuration            = []
              + request_payer                        = "BucketOwner"
              + server_side_encryption_configuration = [
                  + {
                      + rule = [
                          + {
                              + apply_server_side_encryption_by_default = [
                                  + {
                                      + kms_master_key_id = ""
                                      + sse_algorithm     = "AES256"
                                    },
                                ]
                              + bucket_key_enabled                      = false
                            },
                        ]
                    },
                ]
              + tags                                 = {
                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
                  + repo        = "infrahouse/aws-control-493370826424"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
                  + repo        = "infrahouse/aws-control-493370826424"
                }
              + timeouts                             = null
              + versioning                           = [
                  + {
                      + enabled    = true
                      + mfa_delete = false
                    },
                ]
              + website                              = []
              + website_domain                       = null
              + website_endpoint                     = null
            }
          + key    = "terraform.tfstate"
          + region = "us-west-1"
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-493370826424"
      ~ tags                        = {
            "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          + "repo"        = "infrahouse/aws-control-493370826424"
        }
      ~ tags_all                    = {
          + "repo"        = "infrahouse/aws-control-493370826424"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].data.terraform_remote_state.state will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = ""
              + acl                                  = null
              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-990466748045"
              + bucket                               = "infrahouse-aws-control-990466748045"
              + bucket_domain_name                   = "infrahouse-aws-control-990466748045.s3.amazonaws.com"
              + bucket_prefix                        = ""
              + bucket_regional_domain_name          = "infrahouse-aws-control-990466748045.s3.us-west-1.amazonaws.com"
              + cors_rule                            = []
              + force_destroy                        = false
              + grant                                = [
                  + {
                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"
                      + permissions = [
                          + "FULL_CONTROL",
                        ]
                      + type        = "CanonicalUser"
                      + uri         = ""
                    },
                ]
              + hosted_zone_id                       = "Z2F56UZL2M1ACD"
              + id                                   = "infrahouse-aws-control-990466748045"
              + lifecycle_rule                       = []
              + logging                              = []
              + object_lock_configuration            = []
              + object_lock_enabled                  = false
              + policy                               = ""
              + region                               = "us-west-1"
              + replication_configuration            = []
              + request_payer                        = "BucketOwner"
              + server_side_encryption_configuration = [
                  + {
                      + rule = [
                          + {
                              + apply_server_side_encryption_by_default = [
                                  + {
                                      + kms_master_key_id = ""
                                      + sse_algorithm     = "AES256"
                                    },
                                ]
                              + bucket_key_enabled                      = false
                            },
                        ]
                    },
                ]
              + tags                                 = {
                  + description = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
                  + repo        = "infrahouse/aws-control"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
                  + repo        = "infrahouse/aws-control"
                }
              + timeouts                             = null
              + versioning                           = [
                  + {
                      + enabled    = true
                      + mfa_delete = false
                    },
                ]
              + website                              = []
              + website_domain                       = null
              + website_endpoint                     = null
            }
          + key    = "terraform.tfstate"
          + region = "us-west-1"
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-990466748045"
      ~ tags                        = {
            "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          + "repo"        = "infrahouse/aws-control"
        }
      ~ tags_all                    = {
          + "repo"        = "infrahouse/aws-control"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-github-state"].data.terraform_remote_state.state will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = ""
              + acl                                  = null
              + arn                                  = "arn:aws:s3:::infrahouse-github-state"
              + bucket                               = "infrahouse-github-state"
              + bucket_domain_name                   = "infrahouse-github-state.s3.amazonaws.com"
              + bucket_prefix                        = ""
              + bucket_regional_domain_name          = "infrahouse-github-state.s3.us-west-1.amazonaws.com"
              + cors_rule                            = []
              + force_destroy                        = false
              + grant                                = [
                  + {
                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"
                      + permissions = [
                          + "FULL_CONTROL",
                        ]
                      + type        = "CanonicalUser"
                      + uri         = ""
                    },
                ]
              + hosted_zone_id                       = "Z2F56UZL2M1ACD"
              + id                                   = "infrahouse-github-state"
              + lifecycle_rule                       = []
              + logging                              = []
              + object_lock_configuration            = []
              + object_lock_enabled                  = false
              + policy                               = ""
              + region                               = "us-west-1"
              + replication_configuration            = []
              + request_payer                        = "BucketOwner"
              + server_side_encryption_configuration = [
                  + {
                      + rule = [
                          + {
                              + apply_server_side_encryption_by_default = [
                                  + {
                                      + kms_master_key_id = ""
                                      + sse_algorithm     = "AES256"
                                    },
                                ]
                              + bucket_key_enabled                      = false
                            },
                        ]
                    },
                ]
              + tags                                 = {
                  + description = "Terraform state for https://github.com/infrahouse8/github-control"
                  + repo        = "infrahouse8/github-control"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for https://github.com/infrahouse8/github-control"
                  + repo        = "infrahouse8/github-control"
                }
              + timeouts                             = null
              + versioning                           = [
                  + {
                      + enabled    = true
                      + mfa_delete = false
                    },
                ]
              + website                              = []
              + website_domain                       = null
              + website_endpoint                     = null
            }
          + key    = "terraform.tfstate"
          + region = "us-west-1"
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-github-state"
      ~ tags                        = {
            "description" = "Terraform state for https://github.com/infrahouse8/github-control"
          + "repo"        = "infrahouse8/github-control"
        }
      ~ tags_all                    = {
          + "repo"        = "infrahouse8/github-control"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].data.terraform_remote_state.state will be read during apply
  # (config refers to values not yet known)
 <= data "terraform_remote_state" "state" {
      + backend = "s3"
      + config  = {
          + bucket = {
              + acceleration_status                  = (known after apply)
              + acl                                  = (known after apply)
              + arn                                  = (known after apply)
              + bucket                               = "infrahouse-website-infra"
              + bucket_domain_name                   = (known after apply)
              + bucket_prefix                        = (known after apply)
              + bucket_regional_domain_name          = (known after apply)
              + cors_rule                            = (known after apply)
              + force_destroy                        = false
              + grant                                = (known after apply)
              + hosted_zone_id                       = (known after apply)
              + id                                   = (known after apply)
              + lifecycle_rule                       = (known after apply)
              + logging                              = (known after apply)
              + object_lock_configuration            = (known after apply)
              + object_lock_enabled                  = (known after apply)
              + policy                               = (known after apply)
              + region                               = (known after apply)
              + replication_configuration            = (known after apply)
              + request_payer                        = (known after apply)
              + server_side_encryption_configuration = (known after apply)
              + tags                                 = {
                  + description = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
                  + repo        = "infrahouse/infrahouse-website-infra"
                }
              + tags_all                             = {
                  + created_by  = "infrahouse/aws-control-289256138624"
                  + description = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
                  + repo        = "infrahouse/infrahouse-website-infra"
                }
              + timeouts                             = null
              + versioning                           = (known after apply)
              + website                              = (known after apply)
              + website_domain                       = (known after apply)
              + website_endpoint                     = (known after apply)
            }
          + key    = "terraform.tfstate"
          + region = (known after apply)
        }
      + outputs = (known after apply)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be created
  + resource "aws_s3_bucket" "state-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "infrahouse-website-infra"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"        = "infrahouse/infrahouse-website-infra"
        }
      + tags_all                    = {
          + "created_by"  = "infrahouse/aws-control-289256138624"
          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"        = "infrahouse/infrahouse-website-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled will be created
  + resource "aws_s3_bucket_versioning" "enabled" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "000"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::990466748045:user/aleks",
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_ro will be created
  + resource "aws_iam_policy" "permissions_ro" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-infrahouse-website-infra-state-manager-ro"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-website-infra"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-website-infra/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-website-infra/plans/*",
                          + "arn:aws:s3:::infrahouse-website-infra/*.zip",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_rw will be created
  + resource "aws_iam_policy" "permissions_rw" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-infrahouse-website-infra-state-manager-rw"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::infrahouse-website-infra/terraform.tfstate",
                          + "arn:aws:s3:::infrahouse-website-infra/plans/*",
                          + "arn:aws:s3:::infrahouse-website-infra/*.zip",
                        ]
                    },
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager will be created
  + resource "aws_iam_role" "state-manager" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Role to manage a terraform state of a repo"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-infrahouse-website-infra-state-manager"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "created_by" = "infrahouse/aws-control-289256138624"
        }
      + unique_id             = (known after apply)
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-infrahouse-website-infra-state-manager"
    }

  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created
  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-infrahouse-website-infra-state-manager"
    }

Plan: 9 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-github-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-github-control-assume: Read complete after 0s [id=1521129737]%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1154989936]%0Adata.aws_iam_policy_document.ih-tf-aws-control-assume: Read complete after 0s [id=1268673852]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Reading...%0Aaws_dynamodb_table.terraform_locks: Refreshing state... [id=infrahouse-terraform-state-locks]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3211474565]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=3042598441]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=816952319]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.assume: Read complete after 0s [id=2899629952]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3010513807]%0Aaws_iam_role.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::289256138624:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 0s [id=1434185683]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2670099516]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Aaws_iam_role.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=4163919237]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_ro: Read complete after 1s [id=3184570819]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket: Refreshing state... [id=infrahouse-github-state]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-ro20230810231251274700000006]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-ro20230811153208393500000002]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-ro20230810231251272400000005]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_policy.github: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-ro20230810231251270100000004]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-state-manager]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_ro: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-ro20230810231251262700000001]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-read-only-20230811153208651800000003]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125193800000000e]%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3532652678]%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-493370826424-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2241756374]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=842968570]%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-990466748045-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=2865213026]%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager.data.aws_iam_policy_document.permissions_rw: Read complete after 0s [id=3583068592]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125190470000000c]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-303467602807-state-manager-read-only.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-read-only-rw20230811153208390900000001]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=2022835186]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-493370826424-state-manager-rw20230810231251266200000002]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-289256138624-state-manager-rw20230810231251267600000003]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-state-manager-rw20230810231251542800000007]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_policy.permissions_rw: Refreshing state... [id=arn:aws:iam::289256138624:policy/ih-tf-aws-control-303467602807-state-manager-rw20230810231251545600000008]%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy.admin: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-2023081023125190440000000b]%0Adata.aws_iam_policy.administrator-access: Read complete after 1s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github]%0Amodule.ih-tf-aws-control-493370826424-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-493370826424-state-manager-2023081023125187350000000a]%0Aaws_iam_role_policy_attachment.ih-tf-github-control: Refreshing state... [id=ih-tf-github-control-20230627172734370400000002]%0Aaws_iam_role_policy_attachment.ih-tf-aws-control: Refreshing state... [id=ih-tf-aws-control-20230630003530530900000001]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230627172733931200000001]%0Amodule.ih-tf-aws-control-303467602807-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-303467602807-state-manager-20230810231252046000000010]%0Amodule.ih-tf-aws-control-990466748045-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-state-manager-2023081023125199570000000f]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.github: Refreshing state... [id=ih-tf-aws-control-289256138624-github-20230817154309876900000001]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-289256138624-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-state-manager.data.aws_iam_policy_document.assume: Read complete after 0s [id=2704423537]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role.state-manager: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-ro: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-2023081023125191850000000d]%0Amodule.ih-tf-aws-control-289256138624-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0]: Refreshing state... [id=ih-tf-aws-control-289256138624-state-manager-20230810231251872800000009]%0Amodule.ih-tf-aws-control-289256138624-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-289256138624-admin-20230702015240186500000001]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-289256138624]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket_server_side_encryption_configuration.default: Refreshing state... [id=infrahouse-aws-control-493370826424]%0Amodule.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-303467602807]%0Amodule.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-990466748045]%0Amodule.buckets["infrahouse-github-state"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-github-state]%0Amodule.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket_versioning.enabled: Refreshing state... [id=infrahouse-aws-control-289256138624]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.buckets["infrahouse-aws-control-289256138624"].data.terraform_remote_state.state will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = ""%0A              + acl                                  = null%0A              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-289256138624"%0A              + bucket                               = "infrahouse-aws-control-289256138624"%0A              + bucket_domain_name                   = "infrahouse-aws-control-289256138624.s3.amazonaws.com"%0A              + bucket_prefix                        = ""%0A              + bucket_regional_domain_name          = "infrahouse-aws-control-289256138624.s3.us-west-1.amazonaws.com"%0A              + cors_rule                            = []%0A              + force_destroy                        = false%0A              + grant                                = [%0A                  + {%0A                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"%0A                      + permissions = [%0A                          + "FULL_CONTROL",%0A                        ]%0A                      + type        = "CanonicalUser"%0A                      + uri         = ""%0A                    },%0A                ]%0A              + hosted_zone_id                       = "Z2F56UZL2M1ACD"%0A              + id                                   = "infrahouse-aws-control-289256138624"%0A              + lifecycle_rule                       = []%0A              + logging                              = []%0A              + object_lock_configuration            = []%0A              + object_lock_enabled                  = false%0A              + policy                               = ""%0A              + region                               = "us-west-1"%0A              + replication_configuration            = []%0A              + request_payer                        = "BucketOwner"%0A              + server_side_encryption_configuration = [%0A                  + {%0A                      + rule = [%0A                          + {%0A                              + apply_server_side_encryption_by_default = [%0A                                  + {%0A                                      + kms_master_key_id = ""%0A                                      + sse_algorithm     = "AES256"%0A                                    },%0A                                ]%0A                              + bucket_key_enabled                      = false%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + tags                                 = {%0A                  + description = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A                  + repo        = "infrahouse/aws-control-289256138624"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A                  + repo        = "infrahouse/aws-control-289256138624"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = [%0A                  + {%0A                      + enabled    = true%0A                      + mfa_delete = false%0A                    },%0A                ]%0A              + website                              = []%0A              + website_domain                       = null%0A              + website_endpoint                     = null%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = "us-west-1"%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-289256138624"%0A      ~ tags                        = {%0A            "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"%0A          + "repo"        = "infrahouse/aws-control-289256138624"%0A        }%0A      ~ tags_all                    = {%0A          + "repo"        = "infrahouse/aws-control-289256138624"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-303467602807"].data.terraform_remote_state.state will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = ""%0A              + acl                                  = null%0A              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-303467602807"%0A              + bucket                               = "infrahouse-aws-control-303467602807"%0A              + bucket_domain_name                   = "infrahouse-aws-control-303467602807.s3.amazonaws.com"%0A              + bucket_prefix                        = ""%0A              + bucket_regional_domain_name          = "infrahouse-aws-control-303467602807.s3.us-west-1.amazonaws.com"%0A              + cors_rule                            = []%0A              + force_destroy                        = false%0A              + grant                                = [%0A                  + {%0A                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"%0A                      + permissions = [%0A                          + "FULL_CONTROL",%0A                        ]%0A                      + type        = "CanonicalUser"%0A                      + uri         = ""%0A                    },%0A                ]%0A              + hosted_zone_id                       = "Z2F56UZL2M1ACD"%0A              + id                                   = "infrahouse-aws-control-303467602807"%0A              + lifecycle_rule                       = []%0A              + logging                              = []%0A              + object_lock_configuration            = []%0A              + object_lock_enabled                  = false%0A              + policy                               = ""%0A              + region                               = "us-west-1"%0A              + replication_configuration            = []%0A              + request_payer                        = "BucketOwner"%0A              + server_side_encryption_configuration = [%0A                  + {%0A                      + rule = [%0A                          + {%0A                              + apply_server_side_encryption_by_default = [%0A                                  + {%0A                                      + kms_master_key_id = ""%0A                                      + sse_algorithm     = "AES256"%0A                                    },%0A                                ]%0A                              + bucket_key_enabled                      = false%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + tags                                 = {%0A                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A                  + repo        = "infrahouse/aws-control-303467602807"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A                  + repo        = "infrahouse/aws-control-303467602807"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = [%0A                  + {%0A                      + enabled    = true%0A                      + mfa_delete = false%0A                    },%0A                ]%0A              + website                              = []%0A              + website_domain                       = null%0A              + website_endpoint                     = null%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = "us-west-1"%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-303467602807"%0A      ~ tags                        = {%0A            "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"%0A          + "repo"        = "infrahouse/aws-control-303467602807"%0A        }%0A      ~ tags_all                    = {%0A          + "repo"        = "infrahouse/aws-control-303467602807"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].data.terraform_remote_state.state will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = ""%0A              + acl                                  = null%0A              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-493370826424"%0A              + bucket                               = "infrahouse-aws-control-493370826424"%0A              + bucket_domain_name                   = "infrahouse-aws-control-493370826424.s3.amazonaws.com"%0A              + bucket_prefix                        = ""%0A              + bucket_regional_domain_name          = "infrahouse-aws-control-493370826424.s3.us-west-1.amazonaws.com"%0A              + cors_rule                            = []%0A              + force_destroy                        = false%0A              + grant                                = [%0A                  + {%0A                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"%0A                      + permissions = [%0A                          + "FULL_CONTROL",%0A                        ]%0A                      + type        = "CanonicalUser"%0A                      + uri         = ""%0A                    },%0A                ]%0A              + hosted_zone_id                       = "Z2F56UZL2M1ACD"%0A              + id                                   = "infrahouse-aws-control-493370826424"%0A              + lifecycle_rule                       = []%0A              + logging                              = []%0A              + object_lock_configuration            = []%0A              + object_lock_enabled                  = false%0A              + policy                               = ""%0A              + region                               = "us-west-1"%0A              + replication_configuration            = []%0A              + request_payer                        = "BucketOwner"%0A              + server_side_encryption_configuration = [%0A                  + {%0A                      + rule = [%0A                          + {%0A                              + apply_server_side_encryption_by_default = [%0A                                  + {%0A                                      + kms_master_key_id = ""%0A                                      + sse_algorithm     = "AES256"%0A                                    },%0A                                ]%0A                              + bucket_key_enabled                      = false%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + tags                                 = {%0A                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A                  + repo        = "infrahouse/aws-control-493370826424"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A                  + repo        = "infrahouse/aws-control-493370826424"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = [%0A                  + {%0A                      + enabled    = true%0A                      + mfa_delete = false%0A                    },%0A                ]%0A              + website                              = []%0A              + website_domain                       = null%0A              + website_endpoint                     = null%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = "us-west-1"%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-493370826424"%0A      ~ tags                        = {%0A            "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"%0A          + "repo"        = "infrahouse/aws-control-493370826424"%0A        }%0A      ~ tags_all                    = {%0A          + "repo"        = "infrahouse/aws-control-493370826424"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-990466748045"].data.terraform_remote_state.state will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = ""%0A              + acl                                  = null%0A              + arn                                  = "arn:aws:s3:::infrahouse-aws-control-990466748045"%0A              + bucket                               = "infrahouse-aws-control-990466748045"%0A              + bucket_domain_name                   = "infrahouse-aws-control-990466748045.s3.amazonaws.com"%0A              + bucket_prefix                        = ""%0A              + bucket_regional_domain_name          = "infrahouse-aws-control-990466748045.s3.us-west-1.amazonaws.com"%0A              + cors_rule                            = []%0A              + force_destroy                        = false%0A              + grant                                = [%0A                  + {%0A                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"%0A                      + permissions = [%0A                          + "FULL_CONTROL",%0A                        ]%0A                      + type        = "CanonicalUser"%0A                      + uri         = ""%0A                    },%0A                ]%0A              + hosted_zone_id                       = "Z2F56UZL2M1ACD"%0A              + id                                   = "infrahouse-aws-control-990466748045"%0A              + lifecycle_rule                       = []%0A              + logging                              = []%0A              + object_lock_configuration            = []%0A              + object_lock_enabled                  = false%0A              + policy                               = ""%0A              + region                               = "us-west-1"%0A              + replication_configuration            = []%0A              + request_payer                        = "BucketOwner"%0A              + server_side_encryption_configuration = [%0A                  + {%0A                      + rule = [%0A                          + {%0A                              + apply_server_side_encryption_by_default = [%0A                                  + {%0A                                      + kms_master_key_id = ""%0A                                      + sse_algorithm     = "AES256"%0A                                    },%0A                                ]%0A                              + bucket_key_enabled                      = false%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + tags                                 = {%0A                  + description = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A                  + repo        = "infrahouse/aws-control"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A                  + repo        = "infrahouse/aws-control"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = [%0A                  + {%0A                      + enabled    = true%0A                      + mfa_delete = false%0A                    },%0A                ]%0A              + website                              = []%0A              + website_domain                       = null%0A              + website_endpoint                     = null%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = "us-west-1"%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-aws-control-990466748045"%0A      ~ tags                        = {%0A            "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"%0A          + "repo"        = "infrahouse/aws-control"%0A        }%0A      ~ tags_all                    = {%0A          + "repo"        = "infrahouse/aws-control"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-github-state"].data.terraform_remote_state.state will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = ""%0A              + acl                                  = null%0A              + arn                                  = "arn:aws:s3:::infrahouse-github-state"%0A              + bucket                               = "infrahouse-github-state"%0A              + bucket_domain_name                   = "infrahouse-github-state.s3.amazonaws.com"%0A              + bucket_prefix                        = ""%0A              + bucket_regional_domain_name          = "infrahouse-github-state.s3.us-west-1.amazonaws.com"%0A              + cors_rule                            = []%0A              + force_destroy                        = false%0A              + grant                                = [%0A                  + {%0A                      + id          = "eb36733893e2156e023718e30ea212ee0fa16ec917ac95ef8723bde2afc3c431"%0A                      + permissions = [%0A                          + "FULL_CONTROL",%0A                        ]%0A                      + type        = "CanonicalUser"%0A                      + uri         = ""%0A                    },%0A                ]%0A              + hosted_zone_id                       = "Z2F56UZL2M1ACD"%0A              + id                                   = "infrahouse-github-state"%0A              + lifecycle_rule                       = []%0A              + logging                              = []%0A              + object_lock_configuration            = []%0A              + object_lock_enabled                  = false%0A              + policy                               = ""%0A              + region                               = "us-west-1"%0A              + replication_configuration            = []%0A              + request_payer                        = "BucketOwner"%0A              + server_side_encryption_configuration = [%0A                  + {%0A                      + rule = [%0A                          + {%0A                              + apply_server_side_encryption_by_default = [%0A                                  + {%0A                                      + kms_master_key_id = ""%0A                                      + sse_algorithm     = "AES256"%0A                                    },%0A                                ]%0A                              + bucket_key_enabled                      = false%0A                            },%0A                        ]%0A                    },%0A                ]%0A              + tags                                 = {%0A                  + description = "Terraform state for https://github.com/infrahouse8/github-control"%0A                  + repo        = "infrahouse8/github-control"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for https://github.com/infrahouse8/github-control"%0A                  + repo        = "infrahouse8/github-control"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = [%0A                  + {%0A                      + enabled    = true%0A                      + mfa_delete = false%0A                    },%0A                ]%0A              + website                              = []%0A              + website_domain                       = null%0A              + website_endpoint                     = null%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = "us-west-1"%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-github-state"].aws_s3_bucket.state-bucket will be updated in-place%0A  ~ resource "aws_s3_bucket" "state-bucket" {%0A        id                          = "infrahouse-github-state"%0A      ~ tags                        = {%0A            "description" = "Terraform state for https://github.com/infrahouse8/github-control"%0A          + "repo"        = "infrahouse8/github-control"%0A        }%0A      ~ tags_all                    = {%0A          + "repo"        = "infrahouse8/github-control"%0A            # (2 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].data.terraform_remote_state.state will be read during apply%0A  # (config refers to values not yet known)%0A <= data "terraform_remote_state" "state" {%0A      + backend = "s3"%0A      + config  = {%0A          + bucket = {%0A              + acceleration_status                  = (known after apply)%0A              + acl                                  = (known after apply)%0A              + arn                                  = (known after apply)%0A              + bucket                               = "infrahouse-website-infra"%0A              + bucket_domain_name                   = (known after apply)%0A              + bucket_prefix                        = (known after apply)%0A              + bucket_regional_domain_name          = (known after apply)%0A              + cors_rule                            = (known after apply)%0A              + force_destroy                        = false%0A              + grant                                = (known after apply)%0A              + hosted_zone_id                       = (known after apply)%0A              + id                                   = (known after apply)%0A              + lifecycle_rule                       = (known after apply)%0A              + logging                              = (known after apply)%0A              + object_lock_configuration            = (known after apply)%0A              + object_lock_enabled                  = (known after apply)%0A              + policy                               = (known after apply)%0A              + region                               = (known after apply)%0A              + replication_configuration            = (known after apply)%0A              + request_payer                        = (known after apply)%0A              + server_side_encryption_configuration = (known after apply)%0A              + tags                                 = {%0A                  + description = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A                  + repo        = "infrahouse/infrahouse-website-infra"%0A                }%0A              + tags_all                             = {%0A                  + created_by  = "infrahouse/aws-control-289256138624"%0A                  + description = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A                  + repo        = "infrahouse/infrahouse-website-infra"%0A                }%0A              + timeouts                             = null%0A              + versioning                           = (known after apply)%0A              + website                              = (known after apply)%0A              + website_domain                       = (known after apply)%0A              + website_endpoint                     = (known after apply)%0A            }%0A          + key    = "terraform.tfstate"%0A          + region = (known after apply)%0A        }%0A      + outputs = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be created%0A  + resource "aws_s3_bucket" "state-bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "infrahouse-website-infra"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          + "repo"        = "infrahouse/infrahouse-website-infra"%0A        }%0A      + tags_all                    = {%0A          + "created_by"  = "infrahouse/aws-control-289256138624"%0A          + "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"%0A          + "repo"        = "infrahouse/infrahouse-website-infra"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_public_access_block.public_access will be created%0A  + resource "aws_s3_bucket_public_access_block" "public_access" {%0A      + block_public_acls       = true%0A      + block_public_policy     = true%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = true%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_server_side_encryption_configuration.default will be created%0A  + resource "aws_s3_bucket_server_side_encryption_configuration" "default" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + rule {%0A          + apply_server_side_encryption_by_default {%0A              + sse_algorithm = "AES256"%0A            }%0A        }%0A    }%0A%0A  # module.buckets["infrahouse-website-infra"].aws_s3_bucket_versioning.enabled will be created%0A  + resource "aws_s3_bucket_versioning" "enabled" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + versioning_configuration {%0A          + mfa_delete = (known after apply)%0A          + status     = "Enabled"%0A        }%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.data.aws_iam_policy_document.assume will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "assume" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A          + sid     = "000"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "arn:aws:iam::990466748045:user/aleks",%0A                  + (known after apply),%0A                ]%0A              + type        = "AWS"%0A            }%0A        }%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_ro will be created%0A  + resource "aws_iam_policy" "permissions_ro" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-infrahouse-website-infra-state-manager-ro"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "s3:ListBucket"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-website-infra"%0A                    },%0A                  + {%0A                      + Action   = "s3:GetObject"%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-website-infra/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-website-infra/plans/*",%0A                          + "arn:aws:s3:::infrahouse-website-infra/*.zip",%0A                        ]%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_policy.permissions_rw will be created%0A  + resource "aws_iam_policy" "permissions_rw" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = "ih-tf-infrahouse-website-infra-state-manager-rw"%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:PutObject",%0A                          + "s3:DeleteObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = [%0A                          + "arn:aws:s3:::infrahouse-website-infra/terraform.tfstate",%0A                          + "arn:aws:s3:::infrahouse-website-infra/plans/*",%0A                          + "arn:aws:s3:::infrahouse-website-infra/*.zip",%0A                        ]%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "dynamodb:PutItem",%0A                          + "dynamodb:GetItem",%0A                          + "dynamodb:DescribeTable",%0A                          + "dynamodb:DeleteItem",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:dynamodb:us-west-1:289256138624:table/infrahouse-terraform-state-locks"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role.state-manager will be created%0A  + resource "aws_iam_role" "state-manager" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = (known after apply)%0A      + create_date           = (known after apply)%0A      + description           = "Role to manage a terraform state of a repo"%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "ih-tf-infrahouse-website-infra-state-manager"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = {%0A          + "created_by" = "infrahouse/aws-control-289256138624"%0A        }%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-ro will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-ro" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-infrahouse-website-infra-state-manager"%0A    }%0A%0A  # module.ih-tf-infrahouse-website-infra-state-manager.aws_iam_role_policy_attachment.state-manager-rw[0] will be created%0A  + resource "aws_iam_role_policy_attachment" "state-manager-rw" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-infrahouse-website-infra-state-manager"%0A    }%0A%0APlan: 9 to add, 5 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9lMzIzZGZmMy1hMTgxLTRlZGEtOGY0My1lNzUwYTAyNmU2NjYvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTUyMTEyOTczN11cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTU0OTg5OTM2XVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi1hd3MtY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNjg2NzM4NTJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxuYXdzX2R5bmFtb2RiX3RhYmxlLnRlcnJhZm9ybV9sb2NrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zMjExNDc0NTY1XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwNDI1OTg0NDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9ODE2OTUyMzE5XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzAxMDUxMzgwN11cbmF3c19pYW1fcm9sZS5paC10Zi1hd3MtY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2xdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLlxuYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xNDM0MTg1NjgzXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjcwMDk5NTE2XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5hd3NfaWFtX3JvbGUuaWgtdGYtZ2l0aHViLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWdpdGh1Yi1jb250cm9sXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE2MzkxOTIzN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPTMxODQ1NzA4MTldXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTAyMzEyNTEyNzQ3MDAwMDAwMDZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHktcm8yMDIzMDgxMTE1MzIwODM5MzUwMDAwMDAwMl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI3MjQwMDAwMDAwNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1ybzIwMjMwODEwMjMxMjUxMjcwMTAwMDAwMDA0XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI2MjcwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS0yMDIzMDgxMTE1MzIwODY1MTgwMDAwMDAwM11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkzODAwMDAwMDAwZV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTgzMDY4NTkyXVxubW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNTMyNjUyNjc4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQxNzU2Mzc0XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD04NDI5Njg1NzBdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI4NjUyMTMwMjZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1ODMwNjg1OTJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxOTA0NzAwMDAwMDBjXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS1ydzIwMjMwODExMTUzMjA4MzkwOTAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwMjI4MzUxODZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTEyNjYyMDAwMDAwMDJdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTEyNjc2MDAwMDAwMDNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTU0MjgwMDAwMDAwN11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTU0NTYwMDAwMDAwOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5MDQ0MDAwMDAwMGJdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTg3MzUwMDAwMDAwYV1cbmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzQzNzA0MDAwMDAwMDJdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTIwMjMwNjMwMDAzNTMwNTMwOTAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbC0yMDIzMDYyNzE3MjczMzkzMTIwMDAwMDAwMV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTIwNDYwMDAwMDAwMTBdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5OTU3MDAwMDAwMGZdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1naXRodWItMjAyMzA4MTcxNTQzMDk4NzY5MDAwMDAwMDFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDQ0MjM1MzddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTI3MDQ0MjM1MzddXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlcl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5MTg1MDAwMDAwMGRdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxODcyODAwMDAwMDA5XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi0yMDIzMDcwMjAxNTI0MDE4NjUwMDAwMDAwMV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN11cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddXG5tb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV1cbm1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXVxubW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRdXG5cblRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb25cbnBsYW4uIFJlc291cmNlIGFjdGlvbnMgYXJlIGluZGljYXRlZCB3aXRoIHRoZSBmb2xsb3dpbmcgc3ltYm9sczpcbiAgKyBjcmVhdGVcbiAgfiB1cGRhdGUgaW4tcGxhY2VcbiA8PSByZWFkIChkYXRhIHJlc291cmNlcylcblxuVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmRhdGEudGVycmFmb3JtX3JlbW90ZV9zdGF0ZS5zdGF0ZSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwidGVycmFmb3JtX3JlbW90ZV9zdGF0ZVwiIFwic3RhdGVcIiB7XG4gICAgICArIGJhY2tlbmQgPSBcInMzXCJcbiAgICAgICsgY29uZmlnICA9IHtcbiAgICAgICAgICArIGJ1Y2tldCA9IHtcbiAgICAgICAgICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LnMzLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LnMzLnVzLXdlc3QtMS5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgZ3JhbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBpZCAgICAgICAgICA9IFwiZWIzNjczMzg5M2UyMTU2ZTAyMzcxOGUzMGVhMjEyZWUwZmExNmVjOTE3YWM5NWVmODcyM2JkZTJhZmMzYzQzMVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBwZXJtaXNzaW9ucyA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkNhbm9uaWNhbFVzZXJcIlxuICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIlxuICAgICAgICAgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgICArIGxpZmVjeWNsZV9ydWxlICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xXCJcbiAgICAgICAgICAgICAgKyByZXBsaWNhdGlvbl9jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIlxuICAgICAgICAgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBrbXNfbWFzdGVyX2tleV9pZCA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBzc2VfYWxnb3JpdGhtICAgICA9IFwiQUVTMjU2XCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYnVja2V0X2tleV9lbmFibGVkICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRlcnJhZm9ybS1jb250cm9sIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0ZXJyYWZvcm0tY29udHJvbCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICArIHRpbWVvdXRzICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyB2ZXJzaW9uaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIGVuYWJsZWQgICAgPSB0cnVlXG4gICAgICAgICAgICAgICAgICAgICAgKyBtZmFfZGVsZXRlID0gZmFsc2VcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgd2Vic2l0ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgfVxuICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiXG4gICAgICAgICAgKyByZWdpb24gPSBcInVzLXdlc3QtMVwiXG4gICAgICAgIH1cbiAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRlcnJhZm9ybS1jb250cm9sIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKVxuICAgICAgICB9XG4gICAgICAgICMgKDkgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5kYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuc3RhdGUgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseVxuICAjIChkZXBlbmRzIG9uIGEgcmVzb3VyY2Ugb3IgYSBtb2R1bGUgd2l0aCBjaGFuZ2VzIHBlbmRpbmcpXG4gPD0gZGF0YSBcInRlcnJhZm9ybV9yZW1vdGVfc3RhdGVcIiBcInN0YXRlXCIge1xuICAgICAgKyBiYWNrZW5kID0gXCJzM1wiXG4gICAgICArIGNvbmZpZyAgPSB7XG4gICAgICAgICAgKyBidWNrZXQgPSB7XG4gICAgICAgICAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgICAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy5zMy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy5zMy51cy13ZXN0LTEuYW1hem9uYXdzLmNvbVwiXG4gICAgICAgICAgICAgICsgY29yc19ydWxlICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgICAgICAgICArIGdyYW50ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgaWQgICAgICAgICAgPSBcImViMzY3MzM4OTNlMjE1NmUwMjM3MThlMzBlYTIxMmVlMGZhMTZlYzkxN2FjOTVlZjg3MjNiZGUyYWZjM2M0MzFcIlxuICAgICAgICAgICAgICAgICAgICAgICsgcGVybWlzc2lvbnMgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJGVUxMX0NPTlRST0xcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICArIHR5cGUgICAgICAgID0gXCJDYW5vbmljYWxVc2VyXCJcbiAgICAgICAgICAgICAgICAgICAgICArIHVyaSAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgPSBcIloyRjU2VVpMMk0xQUNEXCJcbiAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgICAgICAgKyBsaWZlY3ljbGVfcnVsZSAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIGxvZ2dpbmcgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgICAgICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiXG4gICAgICAgICAgICAgICsgcmVwbGljYXRpb25fY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkJ1Y2tldE93bmVyXCJcbiAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIHJ1bGUgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsga21zX21hc3Rlcl9rZXlfaWQgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgc3NlX2FsZ29yaXRobSAgICAgPSBcIkFFUzI1NlwiXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAgICAgICAgICsgY3JlYXRlZF9ieSAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICAgICAgICAgICAgKyByZXBvICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIlxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgKyB0aW1lb3V0cyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICAgICsgdmVyc2lvbmluZyAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBlbmFibGVkICAgID0gdHJ1ZVxuICAgICAgICAgICAgICAgICAgICAgICsgbWZhX2RlbGV0ZSA9IGZhbHNlXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIHdlYnNpdGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgIH1cbiAgICAgICAgICArIGtleSAgICA9IFwidGVycmFmb3JtLnRmc3RhdGVcIlxuICAgICAgICAgICsgcmVnaW9uID0gXCJ1cy13ZXN0LTFcIlxuICAgICAgICB9XG4gICAgICArIG91dHB1dHMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHtcbiAgICAgICAgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAgIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXG4gICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgfVxuICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJcbiAgICAgICAgICAgICMgKDIgdW5jaGFuZ2VkIGVsZW1lbnRzIGhpZGRlbilcbiAgICAgICAgfVxuICAgICAgICAjICg5IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcblxuICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKVxuIDw9IGRhdGEgXCJ0ZXJyYWZvcm1fcmVtb3RlX3N0YXRlXCIgXCJzdGF0ZVwiIHtcbiAgICAgICsgYmFja2VuZCA9IFwiczNcIlxuICAgICAgKyBjb25maWcgID0ge1xuICAgICAgICAgICsgYnVja2V0ID0ge1xuICAgICAgICAgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICAgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQuczMuYW1hem9uYXdzLmNvbVwiXG4gICAgICAgICAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICArIGNvcnNfcnVsZSAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgKyBncmFudCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIGlkICAgICAgICAgID0gXCJlYjM2NzMzODkzZTIxNTZlMDIzNzE4ZTMwZWEyMTJlZTBmYTE2ZWM5MTdhYzk1ZWY4NzIzYmRlMmFmYzNjNDMxXCJcbiAgICAgICAgICAgICAgICAgICAgICArIHBlcm1pc3Npb25zID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiRlVMTF9DT05UUk9MXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiXG4gICAgICAgICAgICAgICAgICAgICAgKyB1cmkgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMkY1NlVaTDJNMUFDRFwiXG4gICAgICAgICAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBsb2dnaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIG9iamVjdF9sb2NrX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cy13ZXN0LTFcIlxuICAgICAgICAgICAgICArIHJlcGxpY2F0aW9uX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgICAgICAgICAgID0gXCJCdWNrZXRPd25lclwiXG4gICAgICAgICAgICAgICsgc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBydWxlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0ID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGttc19tYXN0ZXJfa2V5X2lkID0gXCJcIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gICAgID0gXCJBRVMyNTZcIlxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICAgICAgICAgKyByZXBvICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICAgICAgICArIGNyZWF0ZWRfYnkgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGNpLWNkIGFjY291bnQgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICsgdGltZW91dHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgZW5hYmxlZCAgICA9IHRydWVcbiAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICB9XG4gICAgICAgICAgKyBrZXkgICAgPSBcInRlcnJhZm9ybS50ZnN0YXRlXCJcbiAgICAgICAgICArIHJlZ2lvbiA9IFwidXMtd2VzdC0xXCJcbiAgICAgICAgfVxuICAgICAgKyBvdXRwdXRzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgIH1cbiAgICAgIH4gdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmRhdGEudGVycmFmb3JtX3JlbW90ZV9zdGF0ZS5zdGF0ZSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwidGVycmFmb3JtX3JlbW90ZV9zdGF0ZVwiIFwic3RhdGVcIiB7XG4gICAgICArIGJhY2tlbmQgPSBcInMzXCJcbiAgICAgICsgY29uZmlnICA9IHtcbiAgICAgICAgICArIGJ1Y2tldCA9IHtcbiAgICAgICAgICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LnMzLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LnMzLnVzLXdlc3QtMS5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgZ3JhbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBpZCAgICAgICAgICA9IFwiZWIzNjczMzg5M2UyMTU2ZTAyMzcxOGUzMGVhMjEyZWUwZmExNmVjOTE3YWM5NWVmODcyM2JkZTJhZmMzYzQzMVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBwZXJtaXNzaW9ucyA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkNhbm9uaWNhbFVzZXJcIlxuICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIlxuICAgICAgICAgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIlxuICAgICAgICAgICAgICArIGxpZmVjeWNsZV9ydWxlICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xXCJcbiAgICAgICAgICAgICAgKyByZXBsaWNhdGlvbl9jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIlxuICAgICAgICAgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBrbXNfbWFzdGVyX2tleV9pZCA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBzc2VfYWxnb3JpdGhtICAgICA9IFwiQUVTMjU2XCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYnVja2V0X2tleV9lbmFibGVkICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRoZSBtYWluIEFXUyBhY2NvdW50IDk5MDQ2Njc0ODA0NSBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCJcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICAgICAgICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0aGUgbWFpbiBBV1MgYWNjb3VudCA5OTA0NjY3NDgwNDUgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2xcIlxuICAgICAgICAgICAgICAgICAgKyByZXBvICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICArIHRpbWVvdXRzICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyB2ZXJzaW9uaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIGVuYWJsZWQgICAgPSB0cnVlXG4gICAgICAgICAgICAgICAgICAgICAgKyBtZmFfZGVsZXRlID0gZmFsc2VcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgd2Vic2l0ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgfVxuICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiXG4gICAgICAgICAgKyByZWdpb24gPSBcInVzLXdlc3QtMVwiXG4gICAgICAgIH1cbiAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIHRoZSBtYWluIEFXUyBhY2NvdW50IDk5MDQ2Njc0ODA0NSBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiXG4gICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmRhdGEudGVycmFmb3JtX3JlbW90ZV9zdGF0ZS5zdGF0ZSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZylcbiA8PSBkYXRhIFwidGVycmFmb3JtX3JlbW90ZV9zdGF0ZVwiIFwic3RhdGVcIiB7XG4gICAgICArIGJhY2tlbmQgPSBcInMzXCJcbiAgICAgICsgY29uZmlnICA9IHtcbiAgICAgICAgICArIGJ1Y2tldCA9IHtcbiAgICAgICAgICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJcbiAgICAgICAgICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlLnMzLmFtYXpvbmF3cy5jb21cIlxuICAgICAgICAgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgICAgICAgICAgPSBcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlLnMzLnVzLXdlc3QtMS5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgZ3JhbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBpZCAgICAgICAgICA9IFwiZWIzNjczMzg5M2UyMTU2ZTAyMzcxOGUzMGVhMjEyZWUwZmExNmVjOTE3YWM5NWVmODcyM2JkZTJhZmMzYzQzMVwiXG4gICAgICAgICAgICAgICAgICAgICAgKyBwZXJtaXNzaW9ucyA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICAgICsgdHlwZSAgICAgICAgPSBcIkNhbm9uaWNhbFVzZXJcIlxuICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIlxuICAgICAgICAgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIlxuICAgICAgICAgICAgICArIGxpZmVjeWNsZV9ydWxlICAgICAgICAgICAgICAgICAgICAgICA9IFtdXG4gICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW11cbiAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIlxuICAgICAgICAgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xXCJcbiAgICAgICAgICAgICAgKyByZXBsaWNhdGlvbl9jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIlxuICAgICAgICAgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGFwcGx5X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fYnlfZGVmYXVsdCA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBrbXNfbWFzdGVyX2tleV9pZCA9IFwiXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBzc2VfYWxnb3JpdGhtICAgICA9IFwiQUVTMjU2XCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYnVja2V0X2tleV9lbmFibGVkICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlOC9naXRodWItY29udHJvbFwiXG4gICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlOC9naXRodWItY29udHJvbFwiXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICAgICAgICAgICsgY3JlYXRlZF9ieSAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICsgdGltZW91dHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbFxuICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgZW5hYmxlZCAgICA9IHRydWVcbiAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXVxuICAgICAgICAgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSBudWxsXG4gICAgICAgICAgICB9XG4gICAgICAgICAgKyBrZXkgICAgPSBcInRlcnJhZm9ybS50ZnN0YXRlXCJcbiAgICAgICAgICArIHJlZ2lvbiA9IFwidXMtd2VzdC0xXCJcbiAgICAgICAgfVxuICAgICAgKyBvdXRwdXRzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlXG4gIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIlxuICAgICAgfiB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2xcIlxuICAgICAgICB9XG4gICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2xcIlxuICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKVxuICAgICAgICB9XG4gICAgICAgICMgKDkgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuXG4gICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHlcbiAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93bilcbiA8PSBkYXRhIFwidGVycmFmb3JtX3JlbW90ZV9zdGF0ZVwiIFwic3RhdGVcIiB7XG4gICAgICArIGJhY2tlbmQgPSBcInMzXCJcbiAgICAgICsgY29uZmlnICA9IHtcbiAgICAgICAgICArIGJ1Y2tldCA9IHtcbiAgICAgICAgICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgY29yc19ydWxlICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgZ3JhbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIGxvZ2dpbmcgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19jb25maWd1cmF0aW9uICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgcmVwbGljYXRpb25fY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICAgICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICAgICAgICAgKyByZXBvICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgICAgICAgICArIGNyZWF0ZWRfYnkgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICArIHRpbWVvdXRzICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IG51bGxcbiAgICAgICAgICAgICAgKyB2ZXJzaW9uaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICAgICsgd2Vic2l0ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgICB9XG4gICAgICAgICAgKyBrZXkgICAgPSBcInRlcnJhZm9ybS50ZnN0YXRlXCJcbiAgICAgICAgICArIHJlZ2lvbiA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICAgfVxuICAgICAgKyBvdXRwdXRzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwic3RhdGUtYnVja2V0XCIge1xuICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmVnaW9uICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXG4gICAgICAgICAgKyBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJcbiAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIlxuICAgICAgICB9XG4gICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrXCIgXCJwdWJsaWNfYWNjZXNzXCIge1xuICAgICAgKyBibG9ja19wdWJsaWNfYWNscyAgICAgICA9IHRydWVcbiAgICAgICsgYmxvY2tfcHVibGljX3BvbGljeSAgICAgPSB0cnVlXG4gICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWdub3JlX3B1YmxpY19hY2xzICAgICAgPSB0cnVlXG4gICAgICArIHJlc3RyaWN0X3B1YmxpY19idWNrZXRzID0gdHJ1ZVxuICAgIH1cblxuICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvblwiIFwiZGVmYXVsdFwiIHtcbiAgICAgICsgYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgcnVsZSB7XG4gICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQge1xuICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gPSBcIkFFUzI1NlwiXG4gICAgICAgICAgICB9XG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZCB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRfdmVyc2lvbmluZ1wiIFwiZW5hYmxlZFwiIHtcbiAgICAgICsgYnVja2V0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgdmVyc2lvbmluZ19jb25maWd1cmF0aW9uIHtcbiAgICAgICAgICArIG1mYV9kZWxldGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICAgICAgKyBzdGF0dXMgICAgID0gXCJFbmFibGVkXCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJhc3N1bWVcIiB7XG4gICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG5cbiAgICAgICsgc3RhdGVtZW50IHtcbiAgICAgICAgICArIGFjdGlvbnMgPSBbXG4gICAgICAgICAgICAgICsgXCJzdHM6QXNzdW1lUm9sZVwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgc2lkICAgICA9IFwiMDAwXCJcblxuICAgICAgICAgICsgcHJpbmNpcGFscyB7XG4gICAgICAgICAgICAgICsgaWRlbnRpZmllcnMgPSBbXG4gICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIsXG4gICAgICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIHR5cGUgICAgICAgID0gXCJBV1NcIlxuICAgICAgICAgICAgfVxuICAgICAgICB9XG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3JvXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lX3ByZWZpeCA9IFwiaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXItcm9cIlxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICAgIHtcbiAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpMaXN0QnVja2V0XCJcbiAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgICArIHtcbiAgICAgICAgICAgICAgICAgICAgICArIEFjdGlvbiAgID0gXCJzMzpHZXRPYmplY3RcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gW1xuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZVwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS9wbGFucy8qXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLyouemlwXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yd1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLXJ3XCJcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcInMzOlB1dE9iamVjdFwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiczM6RGVsZXRlT2JqZWN0XCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhL3RlcnJhZm9ybS50ZnN0YXRlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhL3BsYW5zLypcIixcbiAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEvKi56aXBcIixcbiAgICAgICAgICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpQdXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpHZXRJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZWxldGVJdGVtXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIlxuICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6ZHluYW1vZGI6dXMtd2VzdC0xOjI4OTI1NjEzODYyNDp0YWJsZS9pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc1wiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZVwiIFwic3RhdGUtbWFuYWdlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3N1bWVfcm9sZV9wb2xpY3kgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNyZWF0ZV9kYXRlICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBhIHRlcnJhZm9ybSBzdGF0ZSBvZiBhIHJlcG9cIlxuICAgICAgKyBmb3JjZV9kZXRhY2hfcG9saWNpZXMgPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWF4X3Nlc3Npb25fZHVyYXRpb24gID0gMzYwMFxuICAgICAgKyBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXCJcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICAgICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIlxuICAgICAgICB9XG4gICAgICArIHVuaXF1ZV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm8gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXCJcbiAgICB9XG5cbiAgIyBtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcndcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXCJcbiAgICB9XG5cblBsYW46IDkgdG8gYWRkLCA1IHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG5SZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtYXdzLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWdpdGh1Yi1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTUyMTEyOTczN10lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTE1NDk4OTkzNl0lMEFkYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmloLXRmLWF3cy1jb250cm9sLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI2ODY3Mzg1Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW46IFJlYWRpbmcuLi4lMEFhd3NfZHluYW1vZGJfdGFibGUudGVycmFmb3JtX2xvY2tzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLXRlcnJhZm9ybS1zdGF0ZS1sb2Nrc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mjg5OTYyOTk1Ml0lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzIxMTQ3NDU2NV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzA0MjU5ODQ0MV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE0MzQxODU2ODNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTgxNjk1MjMxOV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODk5NjI5OTUyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTMwMTA1MTM4MDddJTBBYXdzX2lhbV9yb2xlLmloLXRmLWF3cy1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3JvOiBSZWFkaW5nLi4uJTBBYXdzX2lhbV9yb2xlLmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ybzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTQzNDE4NTY4M10lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNjcwMDk5NTE2XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldC5zdGF0ZS1idWNrZXQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQWF3c19pYW1fcm9sZS5paC10Zi1naXRodWItY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtZ2l0aHViLWNvbnRyb2xdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxNjM5MTkyMzddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcm86IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPTMxODQ1NzA4MTldJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1naXRodWItc3RhdGVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI3NDcwMDAwMDAwNl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHktcm8yMDIzMDgxMTE1MzIwODM5MzUwMDAwMDAwMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTAyMzEyNTEyNzI0MDAwMDAwMDVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9wb2xpY3kuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcm8yMDIzMDgxMDIzMTI1MTI3MDEwMDAwMDAwNF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZS5zdGF0ZS1tYW5hZ2VyOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlcl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLXJvMjAyMzA4MTAyMzEyNTEyNjI3MDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LTIwMjMwODExMTUzMjA4NjUxODAwMDAwMDAzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkzODAwMDAwMDAwZV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXItcmVhZC1vbmx5LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1ODMwNjg1OTJdJTBBbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzUzMjY1MjY3OF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjQxNzU2Mzc0XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTg0Mjk2ODU3MF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5wZXJtaXNzaW9uc19ydzogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yODY1MjEzMDI2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LnBlcm1pc3Npb25zX3J3OiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQucGVybWlzc2lvbnNfcnc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM1ODMwNjg1OTJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkwNDcwMDAwMDAwY10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1yZWFkLW9ubHkuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLXJlYWQtb25seS1ydzIwMjMwODExMTUzMjA4MzkwOTAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDIyODM1MTg2XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3BvbGljeS5wZXJtaXNzaW9uc19ydzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjI4OTI1NjEzODYyNDpwb2xpY3kvaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItcncyMDIzMDgxMDIzMTI1MTI2NjIwMDAwMDAwMl0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcnc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjoyODkyNTYxMzg2MjQ6cG9saWN5L2loLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTEyNjc2MDAwMDAwMDNdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC1zdGF0ZS1tYW5hZ2VyLXJ3MjAyMzA4MTAyMzEyNTE1NDI4MDAwMDAwMDddJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3J3OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6Mjg5MjU2MTM4NjI0OnBvbGljeS9paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci1ydzIwMjMwODEwMjMxMjUxNTQ1NjAwMDAwMDA4XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZCBjb21wbGV0ZSBhZnRlciAxcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcm86IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxOTA0NDAwMDAwMDBiXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1yd1swXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE4NzM1MDAwMDAwMGFdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLWdpdGh1Yi1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1naXRodWItY29udHJvbC0yMDIzMDYyNzE3MjczNDM3MDQwMDAwMDAwMl0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtYXdzLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTIwMjMwNjMwMDAzNTMwNTMwOTAwMDAwMDAxXSUwQWF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtMjAyMzA2MjcxNzI3MzM5MzEyMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwNy1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJ3WzBdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDctc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MjA0NjAwMDAwMDAxMF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLXN0YXRlLW1hbmFnZXItMjAyMzA4MTAyMzEyNTE5OTU3MDAwMDAwMGZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtZ2l0aHViLTIwMjMwODE3MTU0MzA5ODc2OTAwMDAwMDAxXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yNzA0NDIzNTM3XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjcwNDQyMzUzN10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LWFkbWluXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGUuc3RhdGUtbWFuYWdlcjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5zdGF0ZS1tYW5hZ2VyLXJvOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtc3RhdGUtbWFuYWdlci0yMDIzMDgxMDIzMTI1MTkxODUwMDAwMDAwZF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNC1zdGF0ZS1tYW5hZ2VyLTIwMjMwODEwMjMxMjUxODcyODAwMDAwMDA5XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQtYWRtaW4tMjAyMzA3MDIwMTUyNDAxODY1MDAwMDAwMDFdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVdJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZV0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN10lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24uZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDddJTBBbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiXS5hd3NfczNfYnVja2V0X3NlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbi5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfdmVyc2lvbmluZy5lbmFibGVkOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNF0lMEFtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtZ2l0aHViLXN0YXRlXSUwQW1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uYXdzX3MzX2J1Y2tldF92ZXJzaW9uaW5nLmVuYWJsZWQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICArIGNyZWF0ZSUwQSAgfiB1cGRhdGUgaW4tcGxhY2UlMEEgPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpJTBBJTBBVGVycmFmb3JtIHdpbGwgcGVyZm9ybSB0aGUgZm9sbG93aW5nIGFjdGlvbnM6JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcInRlcnJhZm9ybV9yZW1vdGVfc3RhdGVcIiBcInN0YXRlXCIgeyUwQSAgICAgICsgYmFja2VuZCA9IFwiczNcIiUwQSAgICAgICsgY29uZmlnICA9IHslMEEgICAgICAgICAgKyBidWNrZXQgPSB7JTBBICAgICAgICAgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICAgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0LnMzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjQuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBncmFudCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgaWQgICAgICAgICAgPSBcImViMzY3MzM4OTNlMjE1NmUwMjM3MThlMzBlYTIxMmVlMGZhMTZlYzkxN2FjOTVlZjg3MjNiZGUyYWZjM2M0MzFcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIHBlcm1pc3Npb25zID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIiUwQSAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiJTBBICAgICAgICAgICAgICArIHJlcGxpY2F0aW9uX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdJTBBICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiUwQSAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0ID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsga21zX21hc3Rlcl9rZXlfaWQgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gICAgID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGVycmFmb3JtLWNvbnRyb2wgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0aW1lb3V0cyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBlbmFibGVkICAgID0gdHJ1ZSUwQSAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IG51bGwlMEEgICAgICAgICAgICB9JTBBICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiJTBBICAgICAgICAgICsgcmVnaW9uID0gXCJ1cy13ZXN0LTFcIiUwQSAgICAgICAgfSUwQSAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0ZXJyYWZvcm0tY29udHJvbCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcInRlcnJhZm9ybV9yZW1vdGVfc3RhdGVcIiBcInN0YXRlXCIgeyUwQSAgICAgICsgYmFja2VuZCA9IFwiczNcIiUwQSAgICAgICsgY29uZmlnICA9IHslMEEgICAgICAgICAgKyBidWNrZXQgPSB7JTBBICAgICAgICAgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICAgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICAgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3LnMzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDcuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBncmFudCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgaWQgICAgICAgICAgPSBcImViMzY3MzM4OTNlMjE1NmUwMjM3MThlMzBlYTIxMmVlMGZhMTZlYzkxN2FjOTVlZjg3MjNiZGUyYWZjM2M0MzFcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIHBlcm1pc3Npb25zID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIiUwQSAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiJTBBICAgICAgICAgICAgICArIHJlcGxpY2F0aW9uX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdJTBBICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiUwQSAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0ID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsga21zX21hc3Rlcl9rZXlfaWQgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gICAgID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0aW1lb3V0cyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBlbmFibGVkICAgID0gdHJ1ZSUwQSAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IG51bGwlMEEgICAgICAgICAgICB9JTBBICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiJTBBICAgICAgICAgICsgcmVnaW9uID0gXCJ1cy13ZXN0LTFcIiUwQSAgICAgICAgfSUwQSAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC0zMDM0Njc2MDI4MDdcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTMwMzQ2NzYwMjgwN1wiJTBBICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcInRlcnJhZm9ybV9yZW1vdGVfc3RhdGVcIiBcInN0YXRlXCIgeyUwQSAgICAgICsgYmFja2VuZCA9IFwiczNcIiUwQSAgICAgICsgY29uZmlnICA9IHslMEEgICAgICAgICAgKyBidWNrZXQgPSB7JTBBICAgICAgICAgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICAgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LnMzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBncmFudCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgaWQgICAgICAgICAgPSBcImViMzY3MzM4OTNlMjE1NmUwMjM3MThlMzBlYTIxMmVlMGZhMTZlYzkxN2FjOTVlZjg3MjNiZGUyYWZjM2M0MzFcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIHBlcm1pc3Npb25zID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIiUwQSAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiJTBBICAgICAgICAgICAgICArIHJlcGxpY2F0aW9uX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdJTBBICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiUwQSAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0ID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsga21zX21hc3Rlcl9rZXlfaWQgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gICAgID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgY2ktY2QgYWNjb3VudCBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0aW1lb3V0cyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBlbmFibGVkICAgID0gdHJ1ZSUwQSAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IG51bGwlMEEgICAgICAgICAgICB9JTBBICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiJTBBICAgICAgICAgICsgcmVnaW9uID0gXCJ1cy13ZXN0LTFcIiUwQSAgICAgICAgfSUwQSAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBjaS1jZCBhY2NvdW50IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICAgIyAoMiB1bmNoYW5nZWQgZWxlbWVudHMgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBJTBBICAgICAgICAjICgzIHVuY2hhbmdlZCBibG9ja3MgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGRlcGVuZHMgb24gYSByZXNvdXJjZSBvciBhIG1vZHVsZSB3aXRoIGNoYW5nZXMgcGVuZGluZyklMEEgPD0gZGF0YSBcInRlcnJhZm9ybV9yZW1vdGVfc3RhdGVcIiBcInN0YXRlXCIgeyUwQSAgICAgICsgYmFja2VuZCA9IFwiczNcIiUwQSAgICAgICsgY29uZmlnICA9IHslMEEgICAgICAgICAgKyBidWNrZXQgPSB7JTBBICAgICAgICAgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICAgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfZG9tYWluX25hbWUgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LnMzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUuczMudXMtd2VzdC0xLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgKyBjb3JzX3J1bGUgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBmb3JjZV9kZXN0cm95ICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBncmFudCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgaWQgICAgICAgICAgPSBcImViMzY3MzM4OTNlMjE1NmUwMjM3MThlMzBlYTIxMmVlMGZhMTZlYzkxN2FjOTVlZjg3MjNiZGUyYWZjM2M0MzFcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIHBlcm1pc3Npb25zID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcIkZVTExfQ09OVFJPTFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQ2Fub25pY2FsVXNlclwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgdXJpICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICA9IFwiWjJGNTZVWkwyTTFBQ0RcIiUwQSAgICAgICAgICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCIlMEEgICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgbG9nZ2luZyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMVwiJTBBICAgICAgICAgICAgICArIHJlcGxpY2F0aW9uX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IFtdJTBBICAgICAgICAgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICAgICAgICAgICA9IFwiQnVja2V0T3duZXJcIiUwQSAgICAgICAgICAgICAgKyBzZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb24gPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgcnVsZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgYXBwbHlfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9ieV9kZWZhdWx0ID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsga21zX21hc3Rlcl9rZXlfaWQgPSBcIlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIHNzZV9hbGdvcml0aG0gICAgID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBidWNrZXRfa2V5X2VuYWJsZWQgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgdGhlIG1haW4gQVdTIGFjY291bnQgOTkwNDY2NzQ4MDQ1IGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0aW1lb3V0cyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHZlcnNpb25pbmcgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBlbmFibGVkICAgID0gdHJ1ZSUwQSAgICAgICAgICAgICAgICAgICAgICArIG1mYV9kZWxldGUgPSBmYWxzZSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICAgICAgICAgICA9IG51bGwlMEEgICAgICAgICAgICB9JTBBICAgICAgICAgICsga2V5ICAgID0gXCJ0ZXJyYWZvcm0udGZzdGF0ZVwiJTBBICAgICAgICAgICsgcmVnaW9uID0gXCJ1cy13ZXN0LTFcIiUwQSAgICAgICAgfSUwQSAgICAgICsgb3V0cHV0cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZSUwQSAgfiByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDVcIiUwQSAgICAgIH4gdGFncyAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgIFwiZGVzY3JpcHRpb25cIiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciB0aGUgbWFpbiBBV1MgYWNjb3VudCA5OTA0NjY3NDgwNDUgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvYXdzLWNvbnRyb2xcIiUwQSAgICAgICAgICArIFwicmVwb1wiICAgICAgICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbFwiJTBBICAgICAgICB9JTBBICAgICAgfiB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sXCIlMEEgICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pJTBBICAgICAgICB9JTBBICAgICAgICAjICg5IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5kYXRhLnRlcnJhZm9ybV9yZW1vdGVfc3RhdGUuc3RhdGUgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoZGVwZW5kcyBvbiBhIHJlc291cmNlIG9yIGEgbW9kdWxlIHdpdGggY2hhbmdlcyBwZW5kaW5nKSUwQSA8PSBkYXRhIFwidGVycmFmb3JtX3JlbW90ZV9zdGF0ZVwiIFwic3RhdGVcIiB7JTBBICAgICAgKyBiYWNrZW5kID0gXCJzM1wiJTBBICAgICAgKyBjb25maWcgID0geyUwQSAgICAgICAgICArIGJ1Y2tldCA9IHslMEEgICAgICAgICAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgICAgICAgICAgID0gXCJcIiUwQSAgICAgICAgICAgICAgKyBhY2wgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCIlMEEgICAgICAgICAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1naXRodWItc3RhdGUuczMuYW1hem9uYXdzLmNvbVwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICAgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lICAgICAgICAgID0gXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZS5zMy51cy13ZXN0LTEuYW1hem9uYXdzLmNvbVwiJTBBICAgICAgICAgICAgICArIGNvcnNfcnVsZSAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFtdJTBBICAgICAgICAgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICAgICArIGdyYW50ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBpZCAgICAgICAgICA9IFwiZWIzNjczMzg5M2UyMTU2ZTAyMzcxOGUzMGVhMjEyZWUwZmExNmVjOTE3YWM5NWVmODcyM2JkZTJhZmMzYzQzMVwiJTBBICAgICAgICAgICAgICAgICAgICAgICsgcGVybWlzc2lvbnMgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiRlVMTF9DT05UUk9MXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgICArIHR5cGUgICAgICAgID0gXCJDYW5vbmljYWxVc2VyXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyB1cmkgICAgICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgID0gXCJaMkY1NlVaTDJNMUFDRFwiJTBBICAgICAgICAgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS1naXRodWItc3RhdGVcIiUwQSAgICAgICAgICAgICAgKyBsaWZlY3ljbGVfcnVsZSAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBsb2dnaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19jb25maWd1cmF0aW9uICAgICAgICAgICAgPSBbXSUwQSAgICAgICAgICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICAgICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xXCIlMEEgICAgICAgICAgICAgICsgcmVwbGljYXRpb25fY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgcmVxdWVzdF9wYXllciAgICAgICAgICAgICAgICAgICAgICAgID0gXCJCdWNrZXRPd25lclwiJTBBICAgICAgICAgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBydWxlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgeyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgKyBrbXNfbWFzdGVyX2tleV9pZCA9IFwiXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICsgc3NlX2FsZ29yaXRobSAgICAgPSBcIkFFUzI1NlwiJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICArIGJ1Y2tldF9rZXlfZW5hYmxlZCAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBkZXNjcmlwdGlvbiA9IFwiVGVycmFmb3JtIHN0YXRlIGZvciBodHRwczovL2dpdGh1Yi5jb20vaW5mcmFob3VzZTgvZ2l0aHViLWNvbnRyb2xcIiUwQSAgICAgICAgICAgICAgICAgICsgcmVwbyAgICAgICAgPSBcImluZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICAgICAgICAgKyBjcmVhdGVkX2J5ICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlOC9naXRodWItY29udHJvbFwiJTBBICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICsgdGltZW91dHMgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyB2ZXJzaW9uaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgZW5hYmxlZCAgICA9IHRydWUlMEEgICAgICAgICAgICAgICAgICAgICAgKyBtZmFfZGVsZXRlID0gZmFsc2UlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgd2Vic2l0ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gW10lMEEgICAgICAgICAgICAgICsgd2Vic2l0ZV9kb21haW4gICAgICAgICAgICAgICAgICAgICAgID0gbnVsbCUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgICAgICAgICAgPSBudWxsJTBBICAgICAgICAgICAgfSUwQSAgICAgICAgICArIGtleSAgICA9IFwidGVycmFmb3JtLnRmc3RhdGVcIiUwQSAgICAgICAgICArIHJlZ2lvbiA9IFwidXMtd2VzdC0xXCIlMEEgICAgICAgIH0lMEEgICAgICArIG91dHB1dHMgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLWdpdGh1Yi1zdGF0ZVwiXS5hd3NfczNfYnVja2V0LnN0YXRlLWJ1Y2tldCB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2UlMEEgIH4gcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJzdGF0ZS1idWNrZXRcIiB7JTBBICAgICAgICBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2UtZ2l0aHViLXN0YXRlXCIlMEEgICAgICB+IHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgICBcImRlc2NyaXB0aW9uXCIgPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgIH0lMEEgICAgICB+IHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcInJlcG9cIiAgICAgICAgPSBcImluZnJhaG91c2U4L2dpdGh1Yi1jb250cm9sXCIlMEEgICAgICAgICAgICAjICgyIHVuY2hhbmdlZCBlbGVtZW50cyBoaWRkZW4pJTBBICAgICAgICB9JTBBICAgICAgICAjICg5IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbiklMEElMEEgICAgICAgICMgKDMgdW5jaGFuZ2VkIGJsb2NrcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uZGF0YS50ZXJyYWZvcm1fcmVtb3RlX3N0YXRlLnN0YXRlIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJ0ZXJyYWZvcm1fcmVtb3RlX3N0YXRlXCIgXCJzdGF0ZVwiIHslMEEgICAgICArIGJhY2tlbmQgPSBcInMzXCIlMEEgICAgICArIGNvbmZpZyAgPSB7JTBBICAgICAgICAgICsgYnVja2V0ID0geyUwQSAgICAgICAgICAgICAgKyBhY2NlbGVyYXRpb25fc3RhdHVzICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyBidWNrZXQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyBidWNrZXRfcmVnaW9uYWxfZG9tYWluX25hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIGNvcnNfcnVsZSAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgZ3JhbnQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgbGlmZWN5Y2xlX3J1bGUgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyBsb2dnaW5nICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIG9iamVjdF9sb2NrX2NvbmZpZ3VyYXRpb24gICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgb2JqZWN0X2xvY2tfZW5hYmxlZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgcmVwbGljYXRpb25fY29uZmlndXJhdGlvbiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIHNlcnZlcl9zaWRlX2VuY3J5cHRpb25fY29uZmlndXJhdGlvbiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gPSBcIlRlcnJhZm9ybSBzdGF0ZSBmb3IgaHR0cHM6Ly9naXRodWIuY29tL2luZnJhaG91c2UvaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICAgICAgICAgICAgICArIHJlcG8gICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICAgICAgICAgICsgY3JlYXRlZF9ieSAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICAgICAgICAgKyByZXBvICAgICAgICA9IFwiaW5mcmFob3VzZS9pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICArIHRpbWVvdXRzICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IG51bGwlMEEgICAgICAgICAgICAgICsgdmVyc2lvbmluZyAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgICAgKyB3ZWJzaXRlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICAgICAgICsgd2Vic2l0ZV9lbmRwb2ludCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICAgKyBrZXkgICAgPSBcInRlcnJhZm9ybS50ZnN0YXRlXCIlMEEgICAgICAgICAgKyByZWdpb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB9JTBBICAgICAgKyBvdXRwdXRzID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXQuc3RhdGUtYnVja2V0IHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zM19idWNrZXRcIiBcInN0YXRlLWJ1Y2tldFwiIHslMEEgICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFjbCAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IFwiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCIlMEEgICAgICArIGJ1Y2tldF9kb21haW5fbmFtZSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldF9wcmVmaXggICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGZvcmNlX2Rlc3Ryb3kgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBob3N0ZWRfem9uZV9pZCAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvYmplY3RfbG9ja19lbmFibGVkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwb2xpY3kgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByZXF1ZXN0X3BheWVyICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTI4OTI1NjEzODYyNFwiJTBBICAgICAgICAgICsgXCJkZXNjcmlwdGlvblwiID0gXCJUZXJyYWZvcm0gc3RhdGUgZm9yIGh0dHBzOi8vZ2l0aHViLmNvbS9pbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICAgICsgXCJyZXBvXCIgICAgICAgID0gXCJpbmZyYWhvdXNlL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiJTBBICAgICAgICB9JTBBICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB3ZWJzaXRlX2VuZHBvaW50ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmJ1Y2tldHNbXCJpbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIl0uYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrLnB1YmxpY19hY2Nlc3Mgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9wdWJsaWNfYWNjZXNzX2Jsb2NrXCIgXCJwdWJsaWNfYWNjZXNzXCIgeyUwQSAgICAgICsgYmxvY2tfcHVibGljX2FjbHMgICAgICAgPSB0cnVlJTBBICAgICAgKyBibG9ja19wdWJsaWNfcG9saWN5ICAgICA9IHRydWUlMEEgICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZ25vcmVfcHVibGljX2FjbHMgICAgICA9IHRydWUlMEEgICAgICArIHJlc3RyaWN0X3B1YmxpY19idWNrZXRzID0gdHJ1ZSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5idWNrZXRzW1wiaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhXCJdLmF3c19zM19idWNrZXRfc2VydmVyX3NpZGVfZW5jcnlwdGlvbl9jb25maWd1cmF0aW9uLmRlZmF1bHQgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldF9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2NvbmZpZ3VyYXRpb25cIiBcImRlZmF1bHRcIiB7JTBBICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBydWxlIHslMEEgICAgICAgICAgKyBhcHBseV9zZXJ2ZXJfc2lkZV9lbmNyeXB0aW9uX2J5X2RlZmF1bHQgeyUwQSAgICAgICAgICAgICAgKyBzc2VfYWxnb3JpdGhtID0gXCJBRVMyNTZcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuYnVja2V0c1tcImluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYVwiXS5hd3NfczNfYnVja2V0X3ZlcnNpb25pbmcuZW5hYmxlZCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0X3ZlcnNpb25pbmdcIiBcImVuYWJsZWRcIiB7JTBBICAgICAgKyBidWNrZXQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyB2ZXJzaW9uaW5nX2NvbmZpZ3VyYXRpb24geyUwQSAgICAgICAgICArIG1mYV9kZWxldGUgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICAgICsgc3RhdHVzICAgICA9IFwiRW5hYmxlZFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lIHdpbGwgYmUgcmVhZCBkdXJpbmcgYXBwbHklMEEgICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pJTBBIDw9IGRhdGEgXCJhd3NfaWFtX3BvbGljeV9kb2N1bWVudFwiIFwiYXNzdW1lXCIgeyUwQSAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGpzb24gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBJTBBICAgICAgKyBzdGF0ZW1lbnQgeyUwQSAgICAgICAgICArIGFjdGlvbnMgPSBbJTBBICAgICAgICAgICAgICArIFwic3RzOkFzc3VtZVJvbGVcIiwlMEEgICAgICAgICAgICBdJTBBICAgICAgICAgICsgc2lkICAgICA9IFwiMDAwXCIlMEElMEEgICAgICAgICAgKyBwcmluY2lwYWxzIHslMEEgICAgICAgICAgICAgICsgaWRlbnRpZmllcnMgPSBbJTBBICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLCUwQSAgICAgICAgICAgICAgICAgICsgKGtub3duIGFmdGVyIGFwcGx5KSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyB0eXBlICAgICAgICA9IFwiQVdTXCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLmF3c19pYW1fcG9saWN5LnBlcm1pc3Npb25zX3JvIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcG9saWN5XCIgXCJwZXJtaXNzaW9uc19yb1wiIHslMEEgICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuYW1lICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ID0gXCJpaC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci1yb1wiJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOkxpc3RCdWNrZXRcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmFcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwiczM6R2V0T2JqZWN0XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gWyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEvdGVycmFmb3JtLnRmc3RhdGVcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhL3BsYW5zLypcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLyouemlwXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9wb2xpY3kucGVybWlzc2lvbnNfcncgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcInBlcm1pc3Npb25zX3J3XCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyLXJ3XCIlMEEgICAgICArIHBhdGggICAgICAgID0gXCIvXCIlMEEgICAgICArIHBvbGljeSAgICAgID0ganNvbmVuY29kZSglMEEgICAgICAgICAgICB7JTBBICAgICAgICAgICAgICArIFN0YXRlbWVudCA9IFslMEEgICAgICAgICAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpQdXRPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJzMzpEZWxldGVPYmplY3RcIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBSZXNvdXJjZSA9IFslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS13ZWJzaXRlLWluZnJhL3RlcnJhZm9ybS50ZnN0YXRlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS9wbGFucy8qXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiYXJuOmF3czpzMzo6OmluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS8qLnppcFwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6UHV0SXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgKyBcImR5bmFtb2RiOkdldEl0ZW1cIiwlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICsgXCJkeW5hbW9kYjpEZXNjcmliZVRhYmxlXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICArIFwiZHluYW1vZGI6RGVsZXRlSXRlbVwiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOmR5bmFtb2RiOnVzLXdlc3QtMToyODkyNTYxMzg2MjQ6dGFibGUvaW5mcmFob3VzZS10ZXJyYWZvcm0tc3RhdGUtbG9ja3NcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgKyBWZXJzaW9uICAgPSBcIjIwMTItMTAtMTdcIiUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSB7JTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlLnN0YXRlLW1hbmFnZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJzdGF0ZS1tYW5hZ2VyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzdW1lX3JvbGVfcG9saWN5ICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVzY3JpcHRpb24gICAgICAgICAgID0gXCJSb2xlIHRvIG1hbmFnZSBhIHRlcnJhZm9ybSBzdGF0ZSBvZiBhIHJlcG9cIiUwQSAgICAgICsgZm9yY2VfZGV0YWNoX3BvbGljaWVzID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1hbmFnZWRfcG9saWN5X2FybnMgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG1heF9zZXNzaW9uX2R1cmF0aW9uICA9IDM2MDAlMEEgICAgICArIG5hbWUgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcGF0aCAgICAgICAgICAgICAgICAgID0gXCIvXCIlMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC0yODkyNTYxMzg2MjRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdW5pcXVlX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5paC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlci5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuc3RhdGUtbWFuYWdlci1ybyB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnRcIiBcInN0YXRlLW1hbmFnZXItcm9cIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWluZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS1zdGF0ZS1tYW5hZ2VyXCIlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtaW5mcmFob3VzZS13ZWJzaXRlLWluZnJhLXN0YXRlLW1hbmFnZXIuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LnN0YXRlLW1hbmFnZXItcndbMF0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJzdGF0ZS1tYW5hZ2VyLXJ3XCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1pbmZyYWhvdXNlLXdlYnNpdGUtaW5mcmEtc3RhdGUtbWFuYWdlclwiJTBBICAgIH0lMEElMEFQbGFuOiA5IHRvIGFkZCwgNSB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDksICJjaGFuZ2UiOiA1LCAiZGVzdHJveSI6IDB9fQ==```
</p></details>